InformationRegisters/бит_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПользователей</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Comment>Значение настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>Настройка</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/бит_УправлениеПользователямиСервер/Ext/Module.bsl
#Область ИнтерфейсыКМетодамТиповыхКонфигураций

Функция ЗначениеПоУмолчаниюТиповой(Настройка, Пользователь = Неопределено) Экспорт
	
	ЗначениеНастройки = Неопределено;
	
	
	Выполнить("ЗначениеНастройки = ОбщегоНазначенияБПВызовСервера.ПолучитьЗначениеПоУмолчанию(Настройка, Пользователь);");
	
	Если ЗначениеНастройки = Неопределено Тогда
		
		// Попробуем получить настройку из имитации типовых настроек.
		НастройкиПоУмолчанию = ТиповыеНастройкиПоУмолчанию();
		ЗначениеНастройки    = НастройкиПоУмолчанию[Настройка];
		
	КонецЕсли; 
	
	
	Возврат ЗначениеНастройки;
	
КонецФункции // ЗначениеПоУмолчаниюТиповой()

Функция ТиповыеНастройкиПоУмолчанию()
	
	Настройки = Новый Соответствие;
	
	Настройки.Вставить("ОсновнойОтветственный"				 		 , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ТекущийПользователь"));
	Настройки.Вставить("ОсновнойКаталогФайлов"				 		 , "");
	Настройки.Вставить("ТипДетализацииСтандартныхОтчетов"	 		 , Неопределено);
	Настройки.Вставить("ЗапрашиватьВидОперацииПриВводеНового"		 , Истина);
	Настройки.Вставить("ОсновнаяСтавкаНДС"					 		 , Перечисления.СтавкиНДС.НДС18);
	Настройки.Вставить("ПоказыватьВПроводкахДанныеНУ"		 		 , Истина);
	Настройки.Вставить("ПечатьДокументовБезПредварительногоПросмотра", Ложь);
	
	Возврат Настройки;
	
КонецФункции // ТиповыеНастройкиПоУмолчанию()

Процедура УстановитьЗначениеПоУмолчаниюТиповой(Настройка, Значение, Пользователь = Неопределено) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Если Пользователь = Неопределено Тогда
			Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		КонецЕсли;		 
		
		Выполнить("УправлениеПользователями.УстановитьЗначениеПоУмолчанию(Пользователь, Настройка, Значение);");
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда	
		
		Выполнить("ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию(Настройка, Значение, Пользователь);");
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьЗначениеПоУмолчаниюТиповой()

Функция ОпределитьТекущегоПользователя(ОписаниеОшибкиОпределенияПользователя = "") Экспорт
	
	флЕстьПользователь = Ложь;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		
		Выполнить("флЕстьПользователь = УправлениеПользователями.ОпределитьТекущегоПользователя(ОписаниеОшибкиОпределенияПользователя);");		
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда	
		
		Выполнить("флЕстьПользователь = Пользователи.ПользовательИБСуществует(ИмяПользователя());");
		
	КонецЕсли; 
	
	Возврат флЕстьПользователь;
	
КонецФункции // ОпределитьТекущегоПользователя()

#КонецОбласти

#Область РаботаСНастройкмиПользователей

Функция ПолучитьЗначениеПоУмолчанию(Настройка, Знач Пользователь = Неопределено) Экспорт
	
	ЗначениеНастройки = Неопределено;
	
	Если Пользователь = Неопределено
		ИЛИ Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь") Тогда
		
		Если Пользователь = Неопределено Тогда
			
			Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
			
		КонецЕсли; 
		
		КэшНастроекПользователей = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЗначенияНастроекПользователей");
		НастройкаСсылка = ПолучитьСсылкуНастройки(Настройка);
		ЗначениеНастройки = КэшНастроекПользователей[НастройкаСсылка];
		Если ЗначениеНастройки = Неопределено Тогда
			ЗначениеНастройки = ПолучитьНастройкуПользователя(Настройка,Пользователь);
			КэшНастроекПользователей[НастройкаСсылка] = ЗначениеНастройки;
			#Если Сервер Тогда
				бит_ОбщиеПеременныеСервер.ЗначениеПеременнойУстановить("бит_ЗначенияНастроекПользователей", КэшНастроекПользователей, Истина);
			#КонецЕсли
		КонецЕсли;	
		
	Иначе
		
		ЗначениеНастройки = ПолучитьНастройкуПользователя(Настройка, Пользователь);
		
	КонецЕсли; 
	
	
	Возврат ЗначениеНастройки;
	
КонецФункции // ПолучитьЗначениеПоУмолчанию()

Процедура УстановитьЗначениеПоУмолчанию(Настройка, Значение, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	КонецЕсли; 
	
	СсылкаНастройки = ПолучитьСсылкуНастройки(Настройка);
	
	МенеджерЗаписи = РегистрыСведений.бит_НастройкиПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь 	 = Пользователь;
	МенеджерЗаписи.Настройка 		 = СсылкаНастройки;
	МенеджерЗаписи.ЗначениеНастройки = Значение;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры // УстановитьЗначениеПоУмолчанию()

Функция ПолучитьНастройкуПользователя(Настройка, Знач Пользователь = Неопределено) Экспорт
	
	Пользователь    = ?(Пользователь = Неопределено, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), Пользователь);
	НастройкаСсылка = ПолучитьСсылкуНастройки(Настройка);
	
	// Значение по-умолчанию.
	ЗначениеНастройки = НастройкаСсылка.ТипЗначения.ПривестиЗначение();
	
	ПвхНастроекБит = ПланыВидовХарактеристик.бит_НастройкиПользователей;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь"		   , Пользователь);
	Запрос.УстановитьПараметр("Настройка"   		   , НастройкаСсылка);
	Запрос.УстановитьПараметр("НастройкаОсновнаяГруппа", ПвхНастроекБит.ОсновнаяГруппаПользователя);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(РегСвНастройки.ЗначениеНастройки) ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	|		ИНАЧЕ МАКСИМУМ(РегСвНастройки.ЗначениеНастройки)
	|	КОНЕЦ КАК Группа
	|ПОМЕСТИТЬ ТабГруппы
	|ИЗ
	|	РегистрСведений.бит_НастройкиПользователей КАК РегСвНастройки
	|ГДЕ
	|	РегСвНастройки.Пользователь = &Пользователь
	|	И РегСвНастройки.Настройка  = &НастройкаОсновнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК Приоритет,
	|	РегСвНастройки.Пользователь КАК ПользовательИлиГруппа,
	|	РегСвНастройки.ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.бит_НастройкиПользователей КАК РегСвНастройки
	|ГДЕ
	|	РегСвНастройки.Пользователь = &Пользователь
	|	И РегСвНастройки.Настройка  = &Настройка
	|
	|ОБЪЕДИНИТЬ ВСЕ  
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	РегСвНастройкиГруппы.Пользователь,
	|	РегСвНастройкиГруппы.ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.бит_НастройкиПользователей КАК РегСвНастройкиГруппы
	|ГДЕ
	|	РегСвНастройкиГруппы.Пользователь В
	|			(ВЫБРАТЬ
	|				ТабГруппы.Группа
	|			ИЗ
	|				ТабГруппы КАК ТабГруппы)
	|	И РегСвНастройкиГруппы.Настройка = &Настройка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		// Настройки, для которых значение по умолчанию = Истина.
		Если НастройкаСсылка 	= ПвхНастроекБит.ПоказыватьДополнительнуюИнформациюБит 
			ИЛИ (Метаданные.Обработки.Найти("бит_ПанельФункций") <> Неопределено И НастройкаСсылка = ПвхНастроекБит.ОткрыватьПриЗапускеПанельФункцийБИТ) Тогда
			ЗначениеНастройки = Истина;		
		КонецЕсли;
		
	Иначе	
		
		Выборка = Результат.Выбрать();		
		Пока Выборка.Следующий() Цикл
			
			ТекущееЗначение = Выборка.ЗначениеНастройки;
			Если ЗначениеЗаполнено(ТекущееЗначение) Или бит_ОбщегоНазначения.ЭтоПримитивныйТип(ТекущееЗначение) Тогда
				ЗначениеНастройки = ТекущееЗначение;
				Прервать;
			КонецЕсли;	
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат ЗначениеНастройки;
	
КонецФункции // ПолучитьНастройкуПользователя()

Функция ПолучитьСсылкуНастройки(Настройка) Экспорт
	
	Если ТипЗнч(Настройка) = Тип("Строка") Тогда
		
		// БИТ_ЖКХ 11.02.2014
		Попытка
			
			НастройкаСсылка = ПланыВидовХарактеристик.бит_НастройкиПользователей[Настройка];
			
		Исключение
			
			НастройкаСсылка = Неопределено;
			
		КонецПопытки;
		
	Иначе
		
		НастройкаСсылка = Настройка;
		
	КонецЕсли; 	
	
	Возврат НастройкаСсылка;
	
КонецФункции // ПолучитьСсылкуНастройки()

#КонецОбласти
